---
kind: type
id: T:Autodesk.Revit.DB.SharedParameterApplicableRule
source: html/64d80468-27ac-8acb-25f1-48bc3597ab87.htm
---
# Autodesk.Revit.DB.SharedParameterApplicableRule

Tests whether an element supports a shared parameter.

## Syntax (C#)
```csharp
public class SharedParameterApplicableRule : FilterRule
```